#############################################################################################################
# ✅разница между defaultdict и обычным dict при добавлении элемента, который не существует.
#   результат один и тот же

# nums = [4, 1, -1, 2, -1, 2, 3]
# nums_counter_1, nums_counter_2 = {}, {}
# for num in nums:
#     nums_counter_1[num] = 1 + nums_counter_1.get(num, 0)
# print(nums_counter_1)
#
# nums_counter_2 = defaultdict(int)
# for num in nums:
#     nums_counter_2[num] += 1
# print(nums_counter_2)

#############################################################################################################
# ✅как посчитать произведение всех элементов массива, кроме текущего
#   - лучше сделать через суффиксы и префиксы
n = [1, 2, 3, 4]
mul = 1
for i in n:
    mul *= i
print(mul)

print([mul//i for i in range(1, len(n) + 1)]) # не учитывает наличие нулей
